""""
Дано кількість діб n. Пройшло m хвилин. Скільки годин та хвилин показує електронний годинник у даний момент. 
Програма має надрукувати два числа: кількість годин (від 0 до 23) та кількість хвилин (від 0 до 59). 
"""
# Час на годиннику

n = input("Введіть кількість днів (n): ")
m = input("Введіть кількість хвилин (m): ")

if n.isdigit() and m.isdigit():
    n = int(n)
    m = int(m)
    total_hours = n * 24 + m // 60
    total_minutes = m % 60
    hours = total_hours % 24
    time_format = "{:02d}:{:02d}".format(hours, total_minutes)
    print("Час: ", time_format)
else:
    print("Помилка. Будь ласка, введіть цифрове значення.")