"""
Площа трикутника - це загальна площа, охоплена межею трикутника. Вона дорівнює половині добутку її основи на висоту. Площа трикутника вимірюється в квадратних одиницях. Якщо основа трикутника дорівнює b, а його висота дорівнює h, то його площа визначається як
Площа трикутника = 1/2 × b × h

Напишіть програму, що приймає довжини 2-х катетів у прямокутному трикутнику та друкує його площину. 
Напишіть програму, що приймає основу і висоту трикутника, та друкує його площину. 

"""

# Обчислення площі трикутника за допомогою катетів
try:
    a = float(input("Введіть довжину першого катета: a= "))
    b = float(input("Введіть довжину другого катета: b= "))

    if a > 0 and b > 0:
        area = 0.5 * a * b
        print("Площа трикутника за допомогою катетів:", area)
    else:
        print("Довжина катетів повинна бути додатнім числом.")
except ValueError:
    print("Введіть числове значення для довжини катетів.")

# Обчислення площі трикутника за допомогою основи і висоти
try:
    b = float(input("Введіть довжину основи трикутника: b= "))
    h = float(input("Введіть висоту трикутника: h= "))

    if b > 0 and h > 0:
        area = 0.5 * b * h
        print("Площа трикутника за допомогою основи і висоти:", area)
    else:
        print("Довжина основи та висоти повинні бути додатніми числами.")
except ValueError:
    print("Введіть числове значення для довжини основи та висоти.")
