"""
Напишіть програму для створення нового рядка, що складається з першого, середнього та останнього символів вхідного рядка.

Дано: str1 = "James"
Очікуваний результат: Jms

"""
str1 = "James"
# Отримання першого символу
first_char = str1[0]
# Отримання останнього символу
last_char = str1[-1]
# Отримання середнього символу
middle_char = str1[len(str1)//2]
# Створення нового рядка, що складається з першого, середнього та останнього символів
new_str = first_char + middle_char + last_char
# Виведення результату
print(new_str)