#Напишіть програму для друку номерів із зазначеного списку після видалення з нього парних чисел.


#список числе буде вводити користувач через Ентер. кінцем введення буде введення порожнього значення. 
#якщо користувач введе інший символ, програма про це має попередити

#фенкція для видалення зі списку парних чисел шляхом формування нового списку тільки з непарними числами
def remove_pair_numbers(numbers):
    # Створюємо новий список, де зберігатимемо лише непарні числа
    odd_numbers = []
    for num in numbers:
        if num % 2 != 0:  # перевірка, чи число непарне
            odd_numbers.append(num)
    return odd_numbers

# Функція для отримання списку чисел від користувача
def get_user_input():
    numbers = []
    while True:
        user_input = input("Введіть число чи залиште порожнім для завершення: ")
        if user_input == "":
            break
        try:
            num = int(user_input)
            numbers.append(num)
        except ValueError:
            print("Введіть дійсне число чи залиште порожнім для завершення.")

    return numbers

# Отримуємо список чисел від користувача
user_numbers = get_user_input()

# Викликаємо функції для видалення парних чисел
filtered_numbers = remove_pair_numbers(user_numbers)

# Перевіряємо, чи є результат порожнім або всі числа є парними
if not filtered_numbers:
    print("Рядок порожній, або всі введені числа є парними")
else:
    print("Список з непарними числами:", filtered_numbers)

