#Напишіть програму, щоб перевірити, порожній список чи ні.

# Запит на введення списку
user_input = input("Введіть елементи списку через кому: ")

# розділяємо рядок за комами і створюємо список
user_list = user_input.split(',')

# пеперевіряємо, чи є список порожнім, враховуючи той факт, що навіть якщо користувач нічого не ввів, спліт створить список з одним порожнім елементом
if len(user_list) == 1 and user_list[0] == '':
    print("Список порожній.")
else:
    print("Список не є порожнім.")